def graphic

    puts "
  ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
  |                                     |
  |  ███████  █████  ███████ ████████   |
  |  ██      ██   ██ ██         ██      |
  |  █████   ███████ ███████    ██      |
  |  ██      ██   ██      ██    ██      |
  |  ██      ██   ██ ███████    ██      |
  |                                     |
  |  ███████  ██████   ██████  ██████   |
  |  ██      ██    ██ ██    ██ ██   ██  |
  |  █████   ██    ██ ██    ██ ██   ██  |
  |  ██      ██    ██ ██    ██ ██   ██  |
  |  ██       ██████   ██████  ██████   |
  |                                     |
  |  ███    ███ ███████                 |
  |  ████  ████ ██                      |
  |  ██ ████ ██ █████                   |
  |  ██  ██  ██ ██                      |
  |  ██      ██ ███████                 |
  |                                     |
  ┗━━━━━━━━━━━━━━━━━━♡ Like It's 1985 ♡━┛ "     
    sleep(1)
    puts "
     ╔.  𝙼𝚊𝚝𝚝𝚑𝚎𝚠 𝚂𝚝𝚎𝚎𝚕𝚎  .═════════╗

     ╚═════════. 𝙼𝚞𝚑𝚊𝚖𝚖𝚎𝚝 𝚈𝚒𝚕𝚍𝚒𝚣  .╝ "
    puts
    sleep(1)                               
end

def menu_header
  sleep(0.5)
  puts "                                         
    ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
    | 𝑭𝑨𝑺𝑻𝑭𝑶𝑶𝑫𝑴𝑬                          |
    ┗━━━━━━━━━━━━━━━━━♡ Like It's 1985 ♡━━┛ "
  puts
  sleep(0.5)
end

def master_menu
  sleep(0.5)
  puts "                                         
    ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
    | Can't Decide?                       |
    ┗━━━━━━━━━━━━━♡ See What's Popular! ♡━┛ "
  puts
  sleep(0.5)
end

def restaurants_header
  sleep(0.5)
  puts "                                         
    ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
    | What are you hungry for?            |
    ┗━━━━━━━━━━━━━━━━━━━━━♡ FASTFOODME! ♡━┛ "
  puts
  sleep(0.5)
end

def mcdonalds_menu
  sleep(0.5)
  puts "                                         
    ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
    | 𝑴𝑪𝑫𝑶𝑵𝑨𝑳𝑫𝑺                           |
    ┗━━━━━━━━━━━━━━━━━━━♡ I'm Lovin' It ♡━┛ "
  puts
  sleep(0.5)
end

def subway_menu
  sleep(0.5)
  puts "                                         
    ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
    | 𝑺𝑼𝑩𝑾𝑨𝒀                              |
    ┗━━━━━━━━━━━━━━━━━━━♡ Eat Fresh ♡━━━━━┛ "
  puts
  sleep(0.5)
end

def burger_king_menu
  sleep(0.5)
  puts "                                         
    ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
    | 𝑩𝑼𝑹𝑮𝑬𝑹 𝑲𝑰𝑵𝑮                         |
    ┗━━━━━━━━━━━━━━━♡ Have It Your Way ♡━━┛ "
  puts
  sleep(0.5)
end

def place_order_header
  sleep(0.5)
  puts "                                         
    ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
    | What would you like to order?       |
    ┗━━━━━━━━━━━━━━━━━━━━♡ It's Cookin! ♡━┛ "
  puts
  sleep(0.5)
end

def customer_orders_header
  sleep(0.5)
  puts "                                         
    ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
    | Thank you for your loyalty!         |
    ┗━━━━━━━━━━━━━━━━━━━━━♡ -FastFoodMe ♡━┛ "
  puts
  sleep(0.5)
end

def cancel_order_header
  sleep(0.5)
  puts "                                         
    ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
    | Which order would you like to cancel? | ⬇
    ┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛"
  puts
  sleep(0.5)
end

def account_information_graphic
  sleep(0.5)
  puts "                                         
    ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
    | 𝑭𝑨𝑺𝑻𝑭𝑶𝑶𝑫𝑴𝑬                            | 
    ┗━━━━━━━━━━━━━━━━━━━━━━━♡ My Account ♡━━┛"
  puts
  sleep(0.5)
  puts "                                         
    ━━━━FULL NAME━━━━       ━━━━USERNAME━━━━
    #{@customer.name}           @#{@customer.username}
    
    ━━━━━ADDRESS━━━━━
    #{@customer.address}

    ━━━━━━PHONE━━━━━━
    #{@customer.phone} 
    "
  puts
end